/***************************************************************************//**
  @ingroup timer
  @defgroup timer_cm4_systick Порт таймера для LPC17xx
  Порт для работы с таймером для микроконтроллеров c ядром Cortex-M4.
  Для получения системного счетчика использует системный таймер (SysTick).
  *****************************************************************************/

/***************************************************************************//**
  @ingroup timer_cm4_systick
  @file ports/cm4_systick/clock_arch.h
  Файл содержит определение типов и констант для работы с системным счетчиком
  для процессоров с ядром Cortex-M4 с использованием системного таймера.
  @date 27.01.2014
  @author Borisov Alexey <borisov@lcard.ru>
 ******************************************************************************/


#ifndef CLOCK_ARCH_H_
#define CLOCK_ARCH_H_

#define CLOCK_CONF_SECOND 1000

typedef unsigned int t_clock;

#endif /* SYSTIC_ARCH_H_ */
